---
kind: method
id: M:Autodesk.Revit.DB.IFC.ImporterIFC.Dispose
source: html/590b60e1-fe30-0664-3efb-f204708c8821.htm
---
# Autodesk.Revit.DB.IFC.ImporterIFC.Dispose Method

Releases all resources used by the ImporterIFC

## Syntax (C#)
```csharp
public void Dispose()
```